===
Current
===
class A feature x
  do
    f(Current)
  end
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (attribute_or_routine
            (feature_body
              (effective_routine
                (internal
                  (routine_mark)
                  (instruction
                    (call
                      (unqualified_call
                        (identifier)
                        (actuals
                          (expression
                            (basic_expression (current))))))))))))))))

===
Void
===
class A feature x
  do
    f(Void)
  end
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (attribute_or_routine
            (feature_body
              (effective_routine
                (internal
                  (routine_mark)
                  (instruction
                    (call
                      (unqualified_call
                        (identifier)
                        (actuals
                          (expression
                            (special_expression (void))))))))))))))))

===
Character constant
===
class A feature x
  do
    f('a')
  end
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (attribute_or_routine
            (feature_body
              (effective_routine
                (internal
                  (routine_mark)
                  (instruction
                    (call
                      (unqualified_call
                        (identifier)
                        (actuals
                          (expression
                            (special_expression
                              (character_constant (character)))))))))))))))))

===
Basic string
===
class A feature x
  do
    f("Hello, World!")
  end
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (attribute_or_routine
            (feature_body
              (effective_routine
                (internal
                  (routine_mark)
                  (instruction
                    (call
                      (unqualified_call
                        (identifier)
                        (actuals
                          (expression
                            (special_expression
                              (manifest_string
                                (basic_manifest_string (string_content))))))))))))))))))
