===
Feature blocks
===
class A
feature
feature
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    features: (features
        (feature_clause)
        (feature_clause))))

===
Feature field
===
class A
feature
  x: INTEGER
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    features: (features
      (feature_clause
        declarations: (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          type: (type (identifier)))))))

===
Feature arguments
===
class A
feature
f(x, y: INTEGER; z: BOOLEAN)
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    features: (features
      (feature_clause
        declarations: (feature_declaration
            (new_feature (extended_feature_name (identifier)))
            arguments: (formal_arguments
              (entity_declaration_list
                (entity_declaration_group
                  identifiers: (identifier_list (identifier) (identifier))
                  type: (type (identifier)))
                (entity_declaration_group
                  identifiers: (identifier_list (identifier))
                  type: (type (identifier))))))))))

===
Clients
===
class A
feature {NONE, ANY, A, B}
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (clients (identifier) (identifier) (identifier) (identifier))))))

===
Feature header comment
===
class A
feature
  -- Header comment
  -- continuation

  -- Normal comment
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (header_comment)))
    (comment)))

===
Feature declaration header comment
===
class A
feature
  x: INTEGER
    -- Header comment
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (type (identifier))
          (header_comment))))))

===
Obsolete
===
class A
feature
  x
    obsolete "msg"
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (obsolete
            (manifest_string (basic_manifest_string (string_content)))))))))

===
Feature. Frozen
===
class A
feature
  frozen a: INTEGER
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature
            (frozen)
            (extended_feature_name (identifier)))
          (type (identifier)))))))

===
Feature. Explicit value
===
class A
feature
  x: INTEGER = 1
end
---
(source_file
  (class_declaration
    (class_name (identifier))
    (features
      (feature_clause
        (feature_declaration
          (new_feature (extended_feature_name (identifier)))
          (type (identifier))
          (explicit_value
            (manifest_constant (manifest_value (integer_constant (integer))))))))))
